src/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчётыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Расходы</xr:Item>
				<xr:Item>AccumulationRegister.Доходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количественный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количественный</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/AccumulationRegisters/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Товары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количественный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчётыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчётыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Расходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Расходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Доходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Доходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количественный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РеализацияТоваровИУслуг/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	Дата = ТекущаяДата();
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = ТоварыИУслуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
		
	Если ТоварыИУслуги.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("В документе отсутсвует номенклатура");
	КонецЕсли;
	
	Для Каждого Строка Из ТоварыИУслуги Цикл
		Если Строка.Количество <= 0 Тогда
			Отказ = Истина;
			Сообщить(СтрШаблон("Не указано количество товара в строке %1", Строка.НомерСтроки));
		КонецЕсли;
	КонецЦикла;
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Очистить();
	Движения.Товары.Очистить();
	Движения.Товары.Записать();
	Движения.ВзаиморасчётыСКонтрагентами.Очистить();
	Движения.ВзаиморасчётыСКонтрагентами.Записать();
	Движения.ВзаиморасчётыСКонтрагентами.Записывать = Истина;
	Движения.Товары.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	Движения.Доходы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Количество) КАК Количество,
	               |	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Сумма) КАК Сумма,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип КАК Тип
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТоварыИУслуги
	               |ГДЕ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
	               |	ВТ_ДанныеДокумента.Количество КАК Количество,
	               |	ВТ_ДанныеДокумента.Сумма КАК Сумма,
	               |	ВТ_ДанныеДокумента.Тип КАК Тип,
	               |	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокТовары,
	               |	ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0) КАК СуммаОстатокТовары,
	               |	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокБух,
	               |	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстатокБух
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки(&Период, ) КАК ТоварыОстатки
	               |		ПО ВТ_ДанныеДокумента.Номенклатура = ТоварыОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	               |				&Период,
	               |				Счет = &СчетТовары,
	               |				,
	               |				Субконто1 В
	               |					(ВЫБРАТЬ
	               |						ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК УправленческийОстатки
	               |		ПО ВТ_ДанныеДокумента.Номенклатура = УправленческийОстатки.Субконто1";


	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени()); 
	Запрос.УстановитьПараметр("СчетТовары", ПланыСчетов.Управленческий.Товары);
	Выборка = Запрос.Выполнить().Выбрать();
    
	 //регистр ВзаиморасчётыСКонтрагентами Расход
    Движение = Движения.ВзаиморасчётыСКонтрагентами.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Контрагент = Покупатель;
    Движение.Сумма = Сумма; 
	
	// Проводка Дт62 Кт90.1
	Проводка = Движения.Управленческий.Добавить();
	Проводка.Период = Дата;
	Проводка.Активность = Истина;
	Проводка.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	Проводка.СчетКт = ПланыСчетов.Управленческий.Выручка;
	Проводка.Сумма = ТоварыИУслуги.Итог("Сумма");
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Тип = Перечисления.ТипыНоменклатуры.Товар Тогда
			Если Выборка.Количество > Выборка.КоличествоОстатокТовары Тогда
				Недостаток = Выборка.Количество - Выборка.КоличествоОстатокТовары;
				Сообщить(СтрШаблон("*РЕГИСТР НАКОПЛЕНИЯ ТОВАРЫ* На складе недостаточно товара %1, не хватает %2",Выборка.Номенклатура, Недостаток));
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
			
			Если Выборка.Количество > Выборка.КоличествоОстатокБух Тогда
				Недостаток = Выборка.Количество - Выборка.КоличествоОстатокБух;
				Сообщить(СтрШаблон("*РЕГИСТР БУХГАЛТЕРИИ* На складе недостаточно товара %1, не хватает %2",Выборка.Номенклатура, Недостаток));
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
			
			Если Выборка.КоличествоОстатокТовары <> Выборка.КоличествоОстатокБух Тогда
				Сообщить(СтрШаблон("Расхождение в регистрах по остаткам товара %1. РЕГИСТР НАКОПЛЕНИЯ ТОВАРЫ = %2. РЕГИСТР БУХГАЛТЕРИИ = %3.", 
						Выборка.Номенклатура, 
						Выборка.КоличествоОстатокТовары,
						Выборка.КоличествоОстатокБух));
			КонецЕсли;
					
			
			Если Выборка.Количество = Выборка.КоличествоОстатокТовары Тогда
				СебестоимостьТовары = Выборка.СуммаОстатокТовары;
				СебестоимостьБух = Выборка.СуммаОстатокБух;
			Иначе
				СебестоимостьТовары = Выборка.Количество * Выборка.СуммаОстатокТовары / Выборка.КоличествоОстатокТовары;
				СебестоимостьБух = Выборка.Количество * Выборка.СуммаОстатокБух / Выборка.КоличествоОстатокБух;
			КонецЕсли;
			//регистр Товары
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.Количество;
			Движение.Сумма = СебестоимостьТовары;
			//регистр расходы
			ДвижениеРасходы = Движения.Расходы.Добавить();
			ДвижениеРасходы.Период = Дата;
			ДвижениеРасходы.Номенклатура = Выборка.Номенклатура;
			ДвижениеРасходы.Сумма = СебестоимостьТовары;
			// Регистр бухгалтерии дт90 кт41
			Проводка = Движения.Управленческий.Добавить();
			Проводка.Период = Дата;
			Проводка.Активность = Истина;
			Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
			Проводка.СчетКт = ПланыСчетов.Управленческий.Товары;
			Проводка.Сумма = СебестоимостьБух;	
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
			Проводка.КоличествоКт = Выборка.Количество;
		КонецЕсли; 
		
		Движение = Движения.Доходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
		
	КонецЦикла;

КонецПроцедуры
